import unorm from "unorm";

export const regexSearchMapper = (str) => {
  str = unorm.nfkc(str);
  str = str.replace(
    /a|à|á|ạ|ả|ã|â|ầ|ấ|ậ|ẩ|ẫ|ă|ằ|ắ|ặ|ẳ|ẵ/g,
    "(a|à|á|ạ|ả|ã|â|ầ|ấ|ậ|ẩ|ẫ|ă|ằ|ắ|ặ|ẳ|ẵ)"
  );
  str = str.replace(/e|è|é|ẹ|ẻ|ẽ|ê|ề|ế|ệ|ể|ễ/g, "(e|è|é|ẹ|ẻ|ẽ|ê|ề|ế|ệ|ể|ễ)");
  str = str.replace(/i|ì|í|ị|ỉ|ĩ/g, "(i|ì|í|ị|ỉ|ĩ)");
  str = str.replace(
    /o|ò|ó|ọ|ỏ|õ|ô|ồ|ố|ộ|ổ|ỗ|ơ|ờ|ớ|ợ|ở|ỡ/g,
    "(o|ò|ó|ọ|ỏ|õ|ô|ồ|ố|ộ|ổ|ỗ|ơ|ờ|ớ|ợ|ở|ỡ)"
  );
  str = str.replace(/u|ù|ú|ụ|ủ|ũ|ư|ừ|ứ|ự|ử|ữ/g, "(u|ù|ú|ụ|ủ|ũ|ư|ừ|ứ|ự|ử|ữ)");
  str = str.replace(/y|ỳ|ý|ỵ|ỷ|ỹ/g, "(y|ỳ|ý|ỵ|ỷ|ỹ)");
  str = str.replace(/d|đ/g, "(d|đ)");
  str = str.replace(
    /A|À|Á|Ạ|Ả|Ã|Â|Ầ|Ấ|Ậ|Ẩ|Ẫ|Ă|Ằ|Ắ|Ặ|Ẳ|Ẵ/g,
    "(A|À|Á|Ạ|Ả|Ã|Â|Ầ|Ấ|Ậ|Ẩ|Ẫ|Ă|Ằ|Ắ|Ặ|Ẳ|Ẵ)"
  );
  str = str.replace(/E|È|É|Ẹ|Ẻ|Ẽ|Ê|Ề|Ế|Ệ|Ể|Ễ/g, "(E|È|É|Ẹ|Ẻ|Ẽ|Ê|Ề|Ế|Ệ|Ể|Ễ)");
  str = str.replace(/I|Ì|Í|Ị|Ỉ|Ĩ/g, "(I|Ì|Í|Ị|Ỉ|Ĩ)");
  str = str.replace(
    /O|Ò|Ó|Ọ|Ỏ|Õ|Ô|Ồ|Ố|Ộ|Ổ|Ỗ|Ơ|Ờ|Ớ|Ợ|Ở|Ỡ/g,
    "(O|Ò|Ó|Ọ|Ỏ|Õ|Ô|Ồ|Ố|Ộ|Ổ|Ỗ|Ơ|Ờ|Ớ|Ợ|Ở|Ỡ)"
  );
  str = str.replace(/U|Ù|Ú|Ụ|Ủ|Ũ|Ư|Ừ|Ứ|Ự|Ử|Ữ/g, "(U|Ù|Ú|Ụ|Ủ|Ũ|Ư|Ừ|Ứ|Ự|Ử|Ữ)");
  str = str.replace(/Y|Ỳ|Ý|Ỵ|Ỷ|Ỹ/g, "(Y|Ỳ|Ý|Ỵ|Ỷ|Ỹ)");
  str = str.replace(/D|Đ/g, "(D|Đ)");
  return str;
};
